// 1. Дан код:
// Почему код даёт именно такие результаты?
var a = 1, b = 1, c, d;
c = ++a; alert(c);           // 2  --> В префиксной форме операторов возвращается уже новое значение
d = b++; alert(d);           // 1  --> В постфиксной форме операторов возвращается исходное значение, а уже после инкрементируется.
c = (2+ ++a); alert(c);      // 5  --> c = (2 + (2 + 1)) = 5
d = (2+ b++); alert(d);      // 4  --> d = (2 + (b=2)) = 4  После выполнения строчки кода b станет равным 3
alert(a);                    // 3  --> a = 3 из 4-й строки
alert(b);                    // 3  --> b = 3 из 5-й строки
